//********************
//      menu.c
//********************
#include<string.h>
#include<stdio.h>
void menu()
{
    puts("\n"); 
	puts("\t|-----------------------------|");
	puts("\t|------------主页-------------|");
	puts("\t|-----------------------------|");
	puts("\t|\t0:退出系统            |");
	puts("\t|\t1:添加火车票信息      |"); //批量添加
	puts("\t|\t2:查询火车票信息      |"); //多种方式查询*
	puts("\t|\t3:订票系统            |"); //两个链表交互
	puts("\t|\t4:修改火车票信息      |"); //序号查重特性*
	puts("\t|\t5:修改购票人信息      |"); //序号查重特性 和火车票链表交互*
	puts("\t|\t6:显示所有火车票信息  |"); 
	puts("\t|\t7:显示所有购票人信息  |"); 
	puts("\t|\t8:读取存档            |");
	puts("\t|\t9:同步信息至文件      |");
	puts("\t|-----------------------------|");
	printf("\n");
}
//主函数用的字符串不是数字
//有goto语句辅助跳多种循环 还有回退操作
